## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.superset-redis.aws_elasticache_cluster.default will be created
  + resource "aws_elasticache_cluster" "default" {
      + apply_immediately          = (known after apply)
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = "true"
      + availability_zone          = (known after apply)
      + az_mode                    = (known after apply)
      + cache_nodes                = (known after apply)
      + cluster_address            = (known after apply)
      + cluster_id                 = "cds-redis"
      + configuration_endpoint     = (known after apply)
      + engine                     = "redis"
      + engine_version             = "7.1"
      + engine_version_actual      = (known after apply)
      + id                         = (known after apply)
      + ip_discovery               = (known after apply)
      + maintenance_window         = (known after apply)
      + network_type               = (known after apply)
      + node_type                  = "cache.t2.micro"
      + num_cache_nodes            = 1
      + parameter_group_name       = "default.redis7"
      + port                       = 6379
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      + security_group_ids         = (known after apply)
      + snapshot_window            = (known after apply)
      + subnet_group_name          = "cds-redis-subnet-grp"
      + tags                       = {
          + "CostCentre" = "cds-superset-prod"
          + "Name"       = "cds-cluster"
          + "Terraform"  = "true"
          + "module"     = "elastic-cache"
        }
      + tags_all                   = {
          + "CostCentre" = "cds-superset-prod"
          + "Name"       = "cds-cluster"
          + "Terraform"  = "true"
          + "module"     = "elastic-cache"
        }
      + transit_encryption_enabled = (known after apply)
    }

  # module.superset-redis.aws_elasticache_subnet_group.default will be created
  + resource "aws_elasticache_subnet_group" "default" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "cds-redis-subnet-grp"
      + subnet_ids  = [
          + "subnet-09fbcf711c8abc44c",
          + "subnet-0b910474dd8b7ce8f",
        ]
      + tags_all    = (known after apply)
    }

  # module.superset-redis.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Default redis security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "cds-redis-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "cds-superset-prod"
          + "Name"       = "cds-sg"
          + "Terraform"  = "true"
          + "module"     = "elastic-cache"
        }
      + tags_all               = {
          + "CostCentre" = "cds-superset-prod"
          + "Name"       = "cds-sg"
          + "Terraform"  = "true"
          + "module"     = "elastic-cache"
        }
      + vpc_id                 = "vpc-0010287ba1021cc5c"
    }

  # module.superset_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/superset"
        name                               = "superset"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset:4" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.superset_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset:4" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu                    = 0
                  - environment            = [
                      - {
                          - name  = "EXAMPLES_DATABASE_DB"
                          - value = "examples"
                        },
                      - {
                          - name  = "SUPERSET_DATABASE_DB"
                          - value = "superset"
                        },
                    ]
                  - essential              = true
                  - image                  = "066023111852.dkr.ecr.ca-central-1.amazonaws.com/superset:latest"
                  - linuxParameters        = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration       = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/superset"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "task"
                        }
                    }
                  - mountPoints            = []
                  - name                   = "superset"
                  - portMappings           = [
                      - {
                          - containerPort = 8088
                          - hostPort      = 8088
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - secrets                = [
                      - {
                          - name      = "SUPERSET_DATABASE_HOST"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_host"
                        },
                      - {
                          - name      = "SUPERSET_DATABASE_USER"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_username"
                        },
                      - {
                          - name      = "SUPERSET_DATABASE_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_database_password"
                        },
                      - {
                          - name      = "SUPERSET_SECRET_KEY"
                          - valueFrom = "arn:aws:ssm:ca-central-1:066023111852:parameter/superset_secret_key"
                        },
                    ]
                  - volumesFrom            = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "superset" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 1 to change, 1 to destroy.

Error: Invalid value for input variable

  on redis.tf line 11, in module "superset-redis":
  11:   allowed_security_groups = {
  12:     "app" = aws_security_group.superset_ecs
  13:   }

The given value is not suitable for
module.superset-redis.var.allowed_security_groups declared at
../modules/aws/redis/input.tf:16,1-35: element "app": string required.
time=2024-01-16T20:18:28Z level=error msg=terraform invocation failed in /home/runner/work/cds-superset/cds-superset/terragrunt
time=2024-01-16T20:18:28Z level=error msg=1 error occurred:
	* [/home/runner/work/cds-superset/cds-superset/terragrunt] exit status 1



```

</details>

